In [2]:
import pandas as pd

/home/quachhuytung/.pyenv/versions/3.8.6/envs/ml-dl/lib/python3.8/site-packages/pandas/compat/__init__.py:120: UserWarning: Could not import the lzma module. Your installed Python is incomplete. Attempting to use lzma compression will result in a RuntimeError.
  warnings.warn(msg)

## Series

In [3]:
data = pd.Series([0.25, 0.5, 0.75, 1.0])

data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [4]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

In [5]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
data[1]

0.5

In [7]:
data[0:3]

0    0.25
1    0.50
2    0.75
dtype: float64

__Bài tập__
khai báo một series có 5 phần tử là 5 chữ cái dạng char bất kì mà các bạn thích. in ra series đó. in ra các phần tử từ phần tử thứ 2 đến phần tử thứ 4

In [8]:
test = pd.Series(['a', 'b', 'c', 'd', 'e'])
test

0    a
1    b
2    c
3    d
4    e
dtype: object

In [11]:
test[1:4]

1    b
2    c
3    d
dtype: object

In [12]:
print("Max: ", data.max())
print("Min: ", data.min())
print("Mean: ", data.mean())
print("Std: ", data.std())

Max:  1.0
Min:  0.25
Mean:  0.625
Std:  0.3227486121839514

### Series construction

#### From array

In [13]:
data = pd.Series([0.25, 0.5, 0.75, 1.0]) ## index mac dinh cua he thong
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [14]:
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                 index=[2, 5, 3, 7])
data ## khai bao index tuong minh

2    0.25
5    0.50
3    0.75
7    1.00
dtype: float64

#### Series can be constructed from dictionary

In [15]:
population_dict = {'California': 38332521,
                   'Texas': 26448193,
                   'New York': 19651127,
                   'Florida': 19552860,
                   'Illinois': 12882135}
population = pd.Series(population_dict)
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [16]:
population['California']

38332521

In [17]:
population['California':'Illinois']

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

## Dataframe

### Dataframe as general Numpy array

In [18]:
area_dict = {'California': 423967, 'Texas': 695662, 'New York': 141297,
             'Florida': 170312, 'Illinois': 149995}
area = pd.Series(area_dict)
area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
dtype: int64

In [19]:
states = pd.DataFrame({'population': population,
                       'area': area})
states

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [20]:
states.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [21]:
states.columns

Index(['population', 'area'], dtype='object')

In [22]:
states.head() # xem cac phan tu ở đầu

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [23]:
states.tail(2) # xem cac phan tu o cuối

          population    area
Florida     19552860  170312
Illinois    12882135  149995

In [24]:
states.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, California to Illinois
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   population  5 non-null      int64
 1   area        5 non-null      int64
dtypes: int64(2)
memory usage: 280.0+ bytes

In [25]:
states.describe()
#count: so luong
# mean: trung binh
# std: do lech chuan
# min: nho nhat
# max: lon nhat

## Note:
# 25%: giá trị của cột mà có 25 % số lượng bản ghi nhỏ hơn nó
# 50%: giá trị của cột mà có 50 % số lượng bản ghi nhỏ hơn nó: Median

         population           area
count  5.000000e+00       5.000000
mean   2.337337e+07  316246.600000
std    9.640386e+06  242437.411951
min    1.288214e+07  141297.000000
25%    1.955286e+07  149995.000000
50%    1.965113e+07  170312.000000
75%    2.644819e+07  423967.000000
max    3.833252e+07  695662.000000

### Dataframe as special dictionary

In [26]:
states['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

__Bài tập__  
so sánh lệnh: states['area'] và lệnh population['California']

### Dataframe construction

#### From single Series object

In [28]:
a = pd.DataFrame(population, columns=['population'])

__Bài tập__  
a có kiểu dữ liệu là gì  **type(a)**  
làm sao để biết các phương thức của a **dir(a)**

In [29]:
type(a)

pandas.core.frame.DataFrame

In [30]:
dir(a)

['T',
 '_AXIS_LEN',
 '_AXIS_NAMES',
 '_AXIS_NUMBERS',
 '_AXIS_ORDERS',
 '_AXIS_REVERSED',
 '_AXIS_TO_AXIS_NUMBER',
 '__abs__',
 '__add__',
 '__and__',
 '__annotations__',
 '__array__',
 '__array_priority__',
 '__array_wrap__',
 '__bool__',
 '__class__',
 '__contains__',
 '__copy__',
 '__deepcopy__',
 '__delattr__',
 '__delitem__',
 '__dict__',
 '__dir__',
 '__div__',
 '__doc__',
 '__eq__',
 '__finalize__',
 '__floordiv__',
 '__format__',
 '__ge__',
 '__getattr__',
 '__getattribute__',
 '__getitem__',
 '__getstate__',
 '__gt__',
 '__hash__',
 '__iadd__',
 '__iand__',
 '__ifloordiv__',
 '__imod__',
 '__imul__',
 '__init__',
 '__init_subclass__',
 '__invert__',
 '__ior__',
 '__ipow__',
 '__isub__',
 '__iter__',
 '__itruediv__',
 '__ixor__',
 '__le__',
 '__len__',
 '__lt__',
 '__matmul__',
 '__mod__',
 '__module__',
 '__mul__',
 '__ne__',
 '__neg__',
 '__new__',
 '__nonzero__',
 '__or__',
 '__pos__',
 '__pow__',
 '__radd__',
 '__rand__',
 '__rdiv__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__rfloordiv__',
 '__rmatmul__',
 '__rmod__',
 '__rmul__',
 '__ror__',
 '__round__',
 '__rpow__',
 '__rsub__',
 '__rtruediv__',
 '__rxor__',
 '__setattr__',
 '__setitem__',
 '__setstate__',
 '__sizeof__',
 '__str__',
 '__sub__',
 '__subclasshook__',
 '__truediv__',
 '__weakref__',
 '__xor__',
 '_accessors',
 '_add_numeric_operations',
 '_add_series_or_dataframe_operations',
 '_agg_by_level',
 '_agg_examples_doc',
 '_agg_summary_and_see_also_doc',
 '_aggregate',
 '_aggregate_multiple_funcs',
 '_align_frame',
 '_align_series',
 '_box_col_values',
 '_builtin_table',
 '_can_fast_transpose',
 '_check_inplace_setting',
 '_check_is_chained_assignment_possible',
 '_check_label_or_level_ambiguity',
 '_check_setitem_copy',
 '_clear_item_cache',
 '_clip_with_one_bound',
 '_clip_with_scalar',
 '_combine_frame',
 '_consolidate',
 '_consolidate_inplace',
 '_construct_axes_dict',
 '_construct_axes_from_arguments',
 '_construct_result',
 '_constructor',
 '_constructor_expanddim',
 '_constructor_sliced',
 '_convert',
 '_count_level',
 '_cython_table',
 '_data',
 '_deprecations',
 '_dir_additions',
 '_dir_deletions',
 '_drop_axis',
 '_drop_labels_or_levels',
 '_ensure_valid_index',
 '_find_valid_index',
 '_from_arrays',
 '_get_agg_axis',
 '_get_axis',
 '_get_axis_name',
 '_get_axis_number',
 '_get_axis_resolvers',
 '_get_block_manager_axis',
 '_get_bool_data',
 '_get_cacher',
 '_get_cleaned_column_resolvers',
 '_get_column_array',
 '_get_cython_func',
 '_get_index_resolvers',
 '_get_item_cache',
 '_get_label_or_level_values',
 '_get_numeric_data',
 '_get_value',
 '_getitem_bool_array',
 '_getitem_multilevel',
 '_gotitem',
 '_indexed_same',
 '_info_axis',
 '_info_axis_name',
 '_info_axis_number',
 '_info_repr',
 '_init_mgr',
 '_internal_names',
 '_internal_names_set',
 '_is_builtin_func',
 '_is_cached',
 '_is_copy',
 '_is_homogeneous_type',
 '_is_label_or_level_reference',
 '_is_label_reference',
 '_is_level_reference',
 '_is_mixed_type',
 '_is_view',
 '_iset_item',
 '_iter_column_arrays',
 '_ix',
 '_ixs',
 '_join_compat',
 '_maybe_cache_changed',
 '_maybe_update_cacher',
 '_metadata',
 '_needs_reindex_multi',
 '_obj_with_exclusions',
 '_protect_consolidate',
 '_reduce',
 '_reindex_axes',
 '_reindex_columns',
 '_reindex_index',
 '_reindex_multi',
 '_reindex_with_indexers',
 '_replace_columnwise',
 '_repr_data_resource_',
 '_repr_fits_horizontal_',
 '_repr_fits_vertical_',
 '_repr_html_',
 '_repr_latex_',
 '_reset_cache',
 '_reset_cacher',
 '_sanitize_column',
 '_selected_obj',
 '_selection',
 '_selection_list',
 '_selection_name',
 '_series',
 '_set_as_cached',
 '_set_axis',
 '_set_axis_name',
 '_set_is_copy',
 '_set_item',
 '_set_value',
 '_setitem_array',
 '_setitem_frame',
 '_setitem_slice',
 '_slice',
 '_stat_axis',
 '_stat_axis_name',
 '_stat_axis_number',
 '_take_with_is_copy',
 '_to_dict_of_blocks',
 '_try_aggregate_string_function',
 '_typ',
 '_update_inplace',
 '_validate_dtype',
 '_values',
 '_where',
 'abs',
 'add',
 'add_prefix',
 'add_suffix',
 'agg',
 'aggregate',
 'align',
 'all',
 'any',
 'append',
 'apply',
 'applymap',
 'asfreq',
 'asof',
 'assign',
 'astype',
 'at',
 'at_time',
 'attrs',
 'axes',
 'backfill',
 'between_time',
 'bfill',
 'bool',
 'boxplot',
 'clip',
 'columns',
 'combine',
 'combine_first',
 'compare',
 'convert_dtypes',
 'copy',
 'corr',
 'corrwith',
 'count',
 'cov',
 'cummax',
 'cummin',
 'cumprod',
 'cumsum',
 'describe',
 'diff',
 'div',
 'divide',
 'dot',
 'drop',
 'drop_duplicates',
 'droplevel',
 'dropna',
 'dtypes',
 'duplicated',
 'empty',
 'eq',
 'equals',
 'eval',
 'ewm',
 'expanding',
 'explode',
 'ffill',
 'fillna',
 'filter',
 'first',
 'first_valid_index',
 'floordiv',
 'from_dict',
 'from_records',
 'ge',
 'get',
 'groupby',
 'gt',
 'head',
 'hist',
 'iat',
 'idxmax',
 'idxmin',
 'iloc',
 'index',
 'infer_objects',
 'info',
 'insert',
 'interpolate',
 'isin',
 'isna',
 'isnull',
 'items',
 'iteritems',
 'iterrows',
 'itertuples',
 'join',
 'keys',
 'kurt',
 'kurtosis',
 'last',
 'last_valid_index',
 'le',
 'loc',
 'lookup',
 'lt',
 'mad',
 'mask',
 'max',
 'mean',
 'median',
 'melt',
 'memory_usage',
 'merge',
 'min',
 'mod',
 'mode',
 'mul',
 'multiply',
 'ndim',
 'ne',
 'nlargest',
 'notna',
 'notnull',
 'nsmallest',
 'nunique',
 'pad',
 'pct_change',
 'pipe',
 'pivot',
 'pivot_table',
 'plot',
 'pop',
 'population',
 'pow',
 'prod',
 'product',
 'quantile',
 'query',
 'radd',
 'rank',
 'rdiv',
 'reindex',
 'reindex_like',
 'rename',
 'rename_axis',
 'reorder_levels',
 'replace',
 'resample',
 'reset_index',
 'rfloordiv',
 'rmod',
 'rmul',
 'rolling',
 'round',
 'rpow',
 'rsub',
 'rtruediv',
 'sample',
 'select_dtypes',
 'sem',
 'set_axis',
 'set_index',
 'shape',
 'shift',
 'size',
 'skew',
 'slice_shift',
 'sort_index',
 'sort_values',
 'squeeze',
 'stack',
 'std',
 'style',
 'sub',
 'subtract',
 'sum',
 'swapaxes',
 'swaplevel',
 'tail',
 'take',
 'to_clipboard',
 'to_csv',
 'to_dict',
 'to_excel',
 'to_feather',
 'to_gbq',
 'to_hdf',
 'to_html',
 'to_json',
 'to_latex',
 'to_markdown',
 'to_numpy',
 'to_parquet',
 'to_period',
 'to_pickle',
 'to_records',
 'to_sql',
 'to_stata',
 'to_string',
 'to_timestamp',
 'to_xarray',
 'transform',
 'transpose',
 'truediv',
 'truncate',
 'tz_convert',
 'tz_localize',
 'unstack',
 'update',
 'value_counts',
 'values',
 'var',
 'where',
 'xs']

#### From a list of dicts

In [37]:
data = [{'a': i, 'b': 2 * i}
        for i in range(3)]
df = pd.DataFrame(data)

__Bài tập__ (yêu cầu trung thực) :V 

lệnh sau output ra gì, tại sao

[{'a': i, 'b': 2 * i} for i in range(3)]

In [31]:
data = []
for i in range(3):
    data.append({'a': i, 'b': 2 * i})

# List comprehension: https://docs.python.org/3/tutorial/datastructures.html?highlight=list%20comprehension

In [32]:
data

[{'a': 0, 'b': 0}, {'a': 1, 'b': 2}, {'a': 2, 'b': 4}]

#### From a dictionary of Series Objects

In [43]:
df = pd.DataFrame({'population': population,
              'area': area})

In [44]:
df.sum()
df.min()

population    12882135
area            141297
dtype: int64

In [45]:
df_copy = df.copy()

In [50]:
# doi ten column
df_copy.rename(columns={"area":"a"}, inplace=True)

In [51]:
df_copy

            population       a
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

##### Pandas không tự đổi tên và gán lại

cần pass option inplace = True vào để gán lại vào dataframe ban đầu

## Indexing and Selection

### Series

In [54]:
import pandas as pd
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                 index=['a', 'b', 'c', 'd'])

data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [53]:
data['b']

0.5

##### Slice by explicit index

In [57]:
## index tuong minh
data['a':'c']

a    0.25
b    0.50
c    0.75
dtype: float64

##### Slice by implicit index

In [58]:
## index ngam dinh
data[0:2]

a    0.25
b    0.50
dtype: float64

###### Masking

In [64]:
data[(data > 0.3) & (data < 0.8)]

b    0.50
c    0.75
dtype: float64

In [59]:
data > 0.3

a    False
b     True
c     True
d     True
dtype: bool

In [60]:
data < 0.8

a     True
b     True
c     True
d    False
dtype: bool

In [61]:
True & False

False

In [62]:
True & True

True

###### Fancy indexing

In [65]:
data[['a', 'd']]

a    0.25
d    1.00
dtype: float64

#### Indexers: loc, iloc

In [66]:
data = pd.Series(['a', 'b', 'c'], index=[1, 3, 5])
data

1    a
3    b
5    c
dtype: object

In [68]:
data[1] ## truy cap 1 index

'a'

In [69]:
data[1:3] ## slicing tren nhieu phan tu

3    b
5    c
dtype: object

__Bài tập trung thực__

Hai dòng lệnh trên trả ra kết quả gì?

In [70]:
data.loc[1:3] # explicit index

1    a
3    b
dtype: object

In [71]:
data.iloc[1:3] # implicit index

3    b
5    c
dtype: object

### DataFrame

In [72]:
area = pd.Series({'California': 423967, 'Texas': 695662,
                  'New York': 141297, 'Florida': 170312,
                  'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
                 'New York': 19651127, 'Florida': 19552860,
                 'Illinois': 12882135})
data = pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [73]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [75]:
data.loc['New York':'Illinois', :'pop']

            area       pop
New York  141297  19651127
Florida   170312  19552860
Illinois  149995  12882135

In [77]:
data.iloc[:3, :2] ## nho hon bien

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

## Operation on data

### Element-wise

In [78]:
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [79]:
import numpy as np
# function as a object
# pass function to other function as parameter

data.applymap(np.log)

# truyen ham(con tro ham log cua np) vao
# ap dung ham np.log voi tung phan tu

                 area        pop
California  12.957411  17.461809
Texas       13.452619  17.090698
New York    11.858619  16.793645
Florida     12.045387  16.788632
Illinois    11.918357  16.371352

In [97]:
def hello():
    return 'hello'

In [98]:
hello

In [99]:
hello() ## function invocation : thuc thi ham

'hello'

__Bài tập__  
1. giải thích tại sao truyền vào np.log mà không phải là np.log()
2. Có cách nào khác để thực hiện không?

__Bài tập về nhà__  
Ý số 2 của bài trên 
1. khai báo function với def
2. khai báo function lambda
3. cách bí mật cực kì đơn giản :))

### Column(Row)-wise

In [80]:
data.apply(np.sum)

area      1581233
pop     116866836
dtype: int64

In [81]:
data.apply(np.sum, axis=1)

California    38756488
Texas         27143855
New York      19792424
Florida       19723172
Illinois      13032130
dtype: int64

## Handling missing data

In [82]:
df = pd.DataFrame([[1,      np.nan, 2],
                   [2,      3,      5],
                   [np.nan, 4,      6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

### Check missing data

In [83]:
df.isnull()

       0      1      2
0  False   True  False
1  False  False  False
2   True  False  False

In [84]:
df.notnull()

       0      1     2
0   True  False  True
1   True   True  True
2  False   True  True

### Drop missing data

In [85]:
df.dropna()

     0    1  2
1  2.0  3.0  5

In [89]:
df.dropna(axis=1)

   2
0  2
1  5
2  6

### Fill missing data

In [91]:
df.isnull()

       0      1      2
0  False   True  False
1  False  False  False
2   True  False  False

In [90]:
df.fillna(df.mean())

     0    1  2
0  1.0  3.5  2
1  2.0  3.0  5
2  1.5  4.0  6

In [92]:
df.fillna(method='ffill')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  2.0  4.0  6

In [94]:
df.fillna(method='ffill', axis=1)

     0    1    2
0  1.0  1.0  2.0
1  2.0  3.0  5.0
2  NaN  4.0  6.0

In [93]:
df.fillna(method='bfill')

     0    1  2
0  1.0  3.0  2
1  2.0  3.0  5
2  NaN  4.0  6

In [95]:
df.fillna(method='bfill', axis=1)

     0    1    2
0  1.0  2.0  2.0
1  2.0  3.0  5.0
2  4.0  4.0  6.0

In [96]:
## khi nao dung mean, median
## khi nao dung ffill, bfill forward backward

# ffill, backfill dung khi lam viec voi time series data
# mean dung khi lam viec voi du lieu so thuc o dang bang bieu

### Group by & aggregation

In [ ]:
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'data': range(6)}, columns=['key', 'data'])
df

In [ ]:
df['key'].unique()

In [ ]:
df['key'].nunique()

In [ ]:
df.groupby('key').sum()

In [ ]:
df.groupby('key').std()

In [ ]:
df.groupby('key').mean()

### Filter

In [ ]:
df.groupby('key').filter(lambda x: x.std() > 1.5)

### Transform

In [ ]:
df.groupby('key').transform(lambda x: x - x.mean())

## Concatenate & Append

In [ ]:
df1 = pd.DataFrame({'A': ['A1', 'A2'], 'B': ['B1', 'B2']})
df1

In [ ]:
df2 = pd.DataFrame({'A': ['A3', 'A4'], 'B': ['B3', 'B4']})
df2

In [ ]:
pd.concat([df1, df2])

In [ ]:
pd.concat([df1, df2], axis=1)

In [ ]:
pd.concat([df1, df2], ignore_index=True)

In [ ]:
df1.append(df2)

In [ ]:
df1.append(df2, ignore_index=True)

### Merge & Join

In [ ]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})

In [ ]:
df1

In [ ]:
df2

In [ ]:
pd.merge(df1, df2)

In [ ]:
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting',
                              'Engineering', 'Engineering', 'HR', 'HR'],
                    'skills': ['math', 'spreadsheets', 'coding', 'linux',
                               'spreadsheets', 'organization']})

In [ ]:
df5

In [ ]:
pd.merge(df1, df5)

In [ ]:
df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'salary': [70000, 80000, 120000, 90000]})

In [ ]:
df3

In [ ]:
pd.merge(df1, df3, left_on='employee', right_on='name')

### Set Arithmetic

In [ ]:
df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],
                    'food': ['fish', 'beans', 'bread']},
                   columns=['name', 'food'])
df7 = pd.DataFrame({'name': ['Mary', 'Joseph'],
                    'drink': ['wine', 'beer']},
                   columns=['name', 'drink'])

In [ ]:
df6

In [ ]:
df7

In [ ]:
pd.merge(df6, df7, how='inner')

In [ ]:
pd.merge(df6, df7, how='outer')

In [ ]:
pd.merge(df6, df7, how='left')

In [ ]:
pd.merge(df6, df7, how='right')

## Vectorized string

In [ ]:
monte = pd.Series(['Graham Chapman', 'John Cleese', 'Terry Gilliam',
                   'Eric Idle', 'Terry Jones', 'Michael Palin'])

In [ ]:
monte.str.len()

In [ ]:
monte.str.capitalize()

In [ ]:
monte.str.upper()

In [ ]:
monte.str.lower()

In [ ]:
monte.str[:3]